-*- eclipse ショートカット集 -*-

o + x ・・・ oとx同時押し
o → x・・・ oしてからx
-------------------------------------
編集系

補完の候補表示: 		 ctrl + space

補完:                Alt + /
※違うのがでたらもう一度押すと変わる

コメントイン/アウト: ctrl + /
※範囲指定可能

自動インテンド: ctrl + a → ctrl + i

戻る: ctrl + z
進む: ctrl + y

1行削除:  ctrl + d

最後の編集場所に戻る: ctrl + Q

エラーが出てるとき
修正方法を教えてくれる:  ctrl + 1

置換: Alt + Shift + r
※変数やメソッドを選んでから

エラー箇所に飛ぶ: ctrl +  ,

定義へ移動: F3

ツールチップを出す F2
---------------------------------------
実行系

実行: F8
デバッグ実行: 	  F11
ステップイン:     F5
ステップオーバー: F6
ステップリターン: F7